finalPaper.tex
% Created 2021-12-16 Thu 20:12
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Alex (Ronny) Menendez, Stanley C. Kemp}
\date{\today}
\title{Untitled three.js Skiing Game}
\hypersetup{
 pdfauthor={Alex (Ronny) Menendez, Stanley C. Kemp},
 pdftitle={Untitled three.js Skiing Game},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{What Each Member Worked On}
\label{sec:org894e570}
Each group member worked on what they wanted to. Here is a general description of
the jobs that each person worked on:
\begin{description}
\item[{Alex}] Research, Presentation
\item[{Stanley}] Paper, Game Coding/Design
\end{description}
\section{Objectives \& Motivation}
\label{sec:org1cc242d}
This group's objective was to create a game capable of running in the browser
using JavaScript and the graphics library three.js, because the members of the
group wanted experience with interactive graphical games. 
\section{Project Description}
\label{sec:org1559b3d}
The completed project would be a game about skiing that would run in the browser.
It would be a top down 2D game navigated with the arrow keys.
\subsection{Premise Details}
\label{sec:org36cdd97}
The score increases with every tick of the clock.
The game is to dodge forward-moving trees while snowboarding in order to
stay up as long as possible, as
the player would take damage to a finite healthbar if they were to hit a tree.
Another hazard that we would add is the monster which chases after the player.
The player would avoid the monster, shooting projectiles that eventually knock
it out of the game for a while.
\subsection{Project History and Challenges}
\label{sec:orge40f4fb}
Originally, the game that would be implemented
was a game where a player would fit an irregular object
through a hole in a surface in order to progress to another level. It was later
decided that there was too little time to implement it before the end of the
semester, so instead another premise had to be chosen for the game.
The chosen idea was inspired by a youtube video on a
3D Dinosaur Game project.
\footnote{This one: \url{https://www.youtube.com/watch?v=KJ38qCwFdy8}}

One challenge was the UI of the application. By design, three.js does not
natively support 2D graphical overlays. There are multiple ways of overcoming
this:
\begin{itemize}
\item Draw the UI using a canvas and exporting to an in-game texture.
\item Overlay some native HTML elements and then update them.
\item Overlay a 2D canvas, then draw the UI on top of it.
\end{itemize}

The group chose the third of these options.

Another challenge was having and designing assets for the game. Originally the
group wanted to import models for our visuals. 
It was decided that to work
around the CORS request issue, the program had to generate its own graphics out
of the built-in graphical primitives, such as spheres, boxes, and cylinders,
as well as the built-in materials, using the classes MeshPhongMaterial and
MeshLambertMaterial, among others. This was the method used to make the assets
of the game.
\section{Implementation Details}
\label{sec:orga95e1da}
This project was designed to pass a memory state holding information about
through each function in a draw
loop. The state of a game gets passed through each function in the structure
as a variable, getting read and modified in order to produce change.

At the end, the state gets processed and turned into a visual representation on
the screen according to the changes made and constants defined on the files,
using a different state called the tapestry, which holds objects relevent to
the graphics side of the application.

These are the functions of various files:
\begin{description}
\item[{\texttt{index.html}}] This is the file that the user sees. It contains the main loop
of the code, input handling, the general HTML structure of the application,
and constants that are necessary to the functioning of the code.
\item[{\texttt{three.min.js}}] This is a minimized JavaScript library made for production
code. It contains the important graphics functions that we need to interface
with WebGL and GLSL. It is included as a tag from \texttt{index.html}.
\item[{\texttt{internalgame.js}}] This file gets included from \texttt{index.html} as a tag.
This is how the internal model of the game acts. The game executes the
functions in this code to know how the game should act internally, and
it holds details about hit detection, damage, and motion.
\item[{\texttt{initialState.js}}] This state holds details about the state that gets
initialized at the start of the game, and saves it to another variable that
holds a copy of the initial state for next rounds.
\item[{\texttt{externalrepresentation.js}}] This file is also included from \texttt{index.html} as
a tag. It translates the current game state from an internal representation to
an external one on the screen.
\item[{\texttt{graphicsInit.js}}] This file contains the initialization code for all the
graphics. It configures the tapestry, lighting, and sets up several graphical
assets, as well as the UI canvas.
\end{description}
\section{Results Analysis}
\label{sec:orgd7d20c9}
At the time of writing, this project has not yet been finished. However,
we have succeeded in getting the graphical portion of the game mostly
coded. Some of the code that wasn't linked up was the hit detection portion
of the code, as well as the motion of the trees forward, although they had
been implemented, they were not linked up to the code.
\section{Next Steps}
\label{sec:org9abee52}
To progress forward, the group should:
\begin{itemize}
\item[{$\square$}] Figure out why the game crashes occasionally
\item[{$\square$}] Connect hit detection to the rest of the game
\item[{$\square$}] Spawn new trees
\item[{$\square$}] Add the monster
\item[{$\square$}] Make the graphics better
\end{itemize}
\end{document}
